<?php
// Require:
define('BOT_TOKEN', '');
define('CHANNEL', '');
define('RANGE_LATLNG', array(
	'minLatitude' => 24,
	'maxLatitude' => 25,
	'minLongitude' => 121,
	'maxLongitude' => 122
));

// Option:
define('GOOGLE_API_KEY', array(
));
define('SCAN', [3, 6, 9, 24, 26, 28, 31, 34, 36, 38, 40, 45, 51, 53, 57, 59, 62, 65, 67, 71, 76, 78, 80, 82, 87, 89, 91, 94, 97, 101, 103, 105, 106, 107, 130, 132, 134, 137, 142, 143, 144, 145, 146, 148, 149, 150, 151]);

define('NAME', [
	1=>'妙蛙種子', 2=>'妙蛙草', 3=>'妙蛙花', 4=>'小火龍', 5=>'火恐龍', 6=>'噴火龍', 7=>'傑尼龜', 8=>'卡咪龜', 9=>'水箭龜', 10=>'綠毛蟲',
	11=>'鐵甲蛹', 12=>'巴大蝶', 13=>'獨角蟲', 14=>'鐵殼蛹', 15=>'大針蜂', 16=>'波波', 17=>'比比鳥', 18=>'大比鳥', 19=>'小拉達', 20=>'拉達',
	21=>'烈雀', 22=>'大嘴雀', 23=>'阿柏蛇', 24=>'阿柏怪', 25=>'皮卡丘', 26=>'雷丘', 27=>'穿山鼠', 28=>'穿山王', 29=>'尼多蘭', 30=>'尼多娜',
	31=>'尼多后', 32=>'尼多朗', 33=>'尼多力諾', 34=>'尼多王', 35=>'皮皮', 36=>'皮可西', 37=>'六尾', 38=>'九尾', 39=>'胖丁', 40=>'胖可丁',
	41=>'超音蝠', 42=>'大嘴蝠', 43=>'走路草', 44=>'臭臭花', 45=>'霸王花', 46=>'派拉斯', 47=>'派拉斯特', 48=>'毛球', 49=>'摩魯蛾', 50=>'地鼠',
	51=>'三地鼠', 52=>'喵喵', 53=>'貓老大', 54=>'可達鴨', 55=>'哥達鴨', 56=>'猴怪', 57=>'火爆猴', 58=>'卡蒂狗', 59=>'風速狗', 60=>'蚊香蝌蚪',
	61=>'蚊香君', 62=>'蚊香泳士', 63=>'凱西', 64=>'勇基拉', 65=>'胡地', 66=>'腕力', 67=>'豪力', 68=>'怪力', 69=>'喇叭芽', 70=>'口呆花',
	71=>'大食花', 72=>'瑪瑙水母', 73=>'毒刺水母', 74=>'小拳石', 75=>'隆隆石', 76=>'隆隆岩', 77=>'小火馬', 78=>'烈焰馬', 79=>'呆呆獸', 80=>'呆殼獸',
	81=>'小磁怪', 82=>'三合一磁怪', 83=>'大蔥鴨', 84=>'嘟嘟', 85=>'嘟嘟利', 86=>'小海獅', 87=>'白海獅', 88=>'臭泥', 89=>'臭臭泥', 90=>'大舌貝',
	91=>'刺甲貝', 92=>'鬼斯', 93=>'鬼斯通', 94=>'耿鬼', 95=>'大岩蛇', 96=>'催眠貘', 97=>'引夢貘人', 98=>'大鉗蟹', 99=>'巨鉗蟹', 100=>'霹靂電球',
	101=>'頑皮雷彈', 102=>'蛋蛋', 103=>'椰蛋樹', 104=>'卡拉卡拉', 105=>'嘎啦嘎啦', 106=>'飛腿郎', 107=>'快拳郎', 108=>'大舌頭', 109=>'瓦斯彈', 110=>'雙彈瓦斯',
	111=>'獨角犀牛', 112=>'鑽角犀獸', 113=>'吉利蛋', 114=>'蔓藤怪', 115=>'袋獸', 116=>'墨海馬', 117=>'海刺龍', 118=>'角金魚', 119=>'金魚王', 120=>'海星星',
	121=>'寶石海星', 122=>'魔牆人偶', 123=>'飛天螳螂', 124=>'迷唇姐', 125=>'電擊獸', 126=>'鴨嘴火獸', 127=>'凱羅斯', 128=>'肯泰羅', 129=>'鯉魚王', 130=>'暴鯉龍',
	131=>'拉普拉斯', 132=>'百變怪', 133=>'伊布', 134=>'水伊布', 135=>'雷伊布', 136=>'火伊布', 137=>'3D龍', 138=>'菊石獸', 139=>'多刺菊石獸', 140=>'化石盔',
	141=>'鐮刀盔', 142=>'化石翼龍', 143=>'卡比獸', 144=>'急凍鳥', 145=>'閃電鳥', 146=>'火焰鳥', 147=>'迷你龍', 148=>'哈克龍', 149=>'快龍', 150=>'超夢', 151=>'夢幻'
]);
